#include <stdio.h>

/*作者姓名: B013040049 黃翊*/
/*撰寫日期: Sep.29,2013*/
/*目的: 印出介於1到50之間所有數之階層*/

int main()
{

int m,carry,i,j,x,k,y; /*m為輸入之階層數，carry為儲存進位數，其他為變數*/
int a[1000]={0}; /*儲存號碼的陣列*/

while(scanf("%d",&m)!=0){
if(m==0){
        break; /*若輸入是0則迴圈跳出*/
}
else{
    a[0]=1; /*初始化a[0]*/
for(i=1;i<=m;i++){
    for(j=0;j<1000;j++){
        a[j]=a[j]*i;
    }
    for(j=0;j<1000;j++){
        carry=a[j]/10; /*把數字除以10，因為這裡是int所以所得到數字為進位數字*/
        a[j]=a[j]%10; /*求除以10的餘數可得到非進位數字*/
        a[j+1]=a[j+1]+carry; /*把下一個數字加上前面所得進位數*/
    }
    for(j=999;j>=0;j--){ /*計算長度*/
        if(a[j]!=0){ /*利用找到不等於0來找長度*/
            k=j;
            break;
        }
    }
    printf("%d ! = ",i);
    for(j=k;j>=0;j--){
        printf("%d",a[j]); /*有長度後從頭印到尾*/
    }
    printf("\n");
}
    for(j=0;j<=1000;j++){ /*利用迴圈讓array歸零*/
        a[j]=0;
}
}
printf("\n");
}
    return 0;
}
